{
  "data": [
    "“I wish everyone could get rich and famous and everything they ever dreamed of so they can see that’s not the answer.” – Jim Carrey",
    "“Creative people don’t behave very well generally. If you’re looking for examples of good relationships in show business, you’re gonna be depressed real fast. I don’t have time for anything else right now but work and my daughter. She’s my first priority.” – Jim Carrey",
    "“Life opens up opportunities to you, and you either take them or you stay afraid of taking them.” – Jim Carrey",
    "“It is better to risk starving to death than surrender. If you give up on your dreams, what’s left?” – Jim Carrey",
    "“Behind every great man is a woman rolling her eyes.” – Jim Carrey",
    "“I just want to be myself.” – Jim Carrey",
    "“That’s the trouble with being me. At this point, nobody gives a damn what my problem is. I could literally have a tumor on the side of my head and they’d be like, ‘Yeah, big deal. I’d eat a tumor every morning for the kinda money you’re pulling down.'” – Jim Carrey",
    "will also enjoy our article on sacrifice quotes.",
    "“Maybe other people will try to limit me but I don’t limit myself.” – Jim Carrey",
    "“I tend to stay up late, not because I’m partying but because it’s the only time of the day when I’m alone and don’t have to be performing.” – Jim Carrey",
    "“Morgan Freeman is so class. He’s so cool. He’s so scary.” – Jim Carrey",
    "“It’s nice to finally get scripts offered to me that aren’t the ones Tom Hanks wipes his butt with.” – Jim Carrey",
    "will also enjoy our article on Ace Ventura quotes.",
    "“People need motivation to do anything. I don’t think human beings learn anything without desperation.” – Jim Carrey",
    "“I’m the first to admit this whole salary thing is getting out of control. In the final analysis, it’s still about the work.” – Jim Carrey",
    "“My focus is to forget the pain of life. Forget the pain, mock the pain, reduce it. And laugh.” – Jim Carrey",
    "“I got a lot of support from my parents. That’s the one thing I always appreciated. They didn’t tell me I was being stupid; they told me I was being funny.” – Jim Carrey",
    "“I practiced making faces in the mirror and it would drive my mother crazy. She used to scare me by saying that I was going to see the devil if I kept looking in the mirror. That fascinated me even more, of course.” – Jim Carrey\\nIf you’re enjoying these quotes, you’ll love our collection of mirror quotes that will change your perception.",
    "will also enjoy our article on Dumb and Dumber quotes.",
    "“Life is an ordeal, albeit an exciting one, but I wouldn’t trade it for the good old days of poverty and obscurity.” – Jim Carrey",
    "“I don’t think human beings learn anything without desperation. Desperation is a necessary ingredient to learning anything or creating anything. Period. If you ain’t desperate at some point, you ain’t interesting.” – Jim Carrey",
    "“If you aren’t in the moment, you are either looking forward to uncertainty, or back to pain and regret.” – Jim Carrey",
    "“Maybe there is no actual place called hell. Maybe hell is just having to listen to our grandparents breathe through their noses when they’re eating sandwiches.” – Jim Carrey",
    "“My upbringing in Canada made me the person I am. I will always be proud to be a Canadian.” – Jim Carrey",
    "“I try to do something the audience might not have seen before. Like if I’m gonna kiss a girl I wanna kiss her like a girl has never been kissed. Like maybe I would kick her legs out from under her and catch her right before she hits the ground and then kiss her.” – Jim Carrey",
    "“I love playing ego and insecurity combined.” – Jim Carrey",
    "“My family kinda hit the skids. We were experiencing poverty at that point. We all got a job, where the whole family had to work as security guards and janitors. And I just got angry.” – Jim Carrey",
    "“My life is not unlike Truman’s. I can’t go anywhere.” – Jim Carrey",
    "“My report card always said, ‘Jim finishes first and then disrupts the other students’.” – Jim Carrey",
    "“I’ve tried everything. I’ve done therapy, I’ve done colonics. I went to a psychic who had me running around town buying pieces of ribbon to fill the colors in my aura. Did the Prozac thing.” – Jim Carrey",
    "“What I have in common with the character in ‘Truman’ is this incredible need to please people. I feel like I want to take care of everyone and I also feel this terrible guilt if I am unable to. And I have felt this way ever since all this success started.” – Jim Carrey",
    "“Originality is really important.” – Jim Carrey",
    "“I think I could go away tomorrow. I’ve already accomplished something. It’s such a selfish business that sometimes I get sick of myself.” – Jim Carrey",
    "“I feel like I want to take care of everyone and I also feel this terrible guilt if I am unable to. And I have felt this way ever since all this success started.” – Jim Carrey",
    "“I need privacy. I would think that because what I do makes a lot of people happy that I might deserve a little bit of respect in return. Instead, the papers try to drag me off my pedestal.” – Jim Carrey",
    "“I know this sounds strange, but as a kid, I was really shy. Painfully shy. The turning point was freshman year, when I was the biggest geek alive. No one, I mean no one, even talked to me.” – Jim Carrey",
    "“Green Eggs and Ham was the story of my life. I wouldn’t eat a thing when I was a kid, but Dr. Seuss inspired me to try cauliflower!” – Jim Carrey",
    "“A lot of good love can happen in ten years.” – Jim Carrey",
    "“If I had never ventured beyond being a stand-up comic, then I would be sitting in my house today working on my Leonardo DiCaprio impression.” – Jim Carrey",
    "“Before I do anything, I think, well what hasn’t been seen. Sometimes, that turns out to be something ghastly and not fit for society. And sometimes that inspiration becomes something that’s really worthwhile.” – Jim Carrey",
    "“My mother was a professional sick person; she took a lot of pain pills. There are many people like that. It’s just how they are used to getting attention. I always remember she’s the daughter of alcoholics who’d leave her alone at Christmas time.” – Jim Carrey",
    "“You know, I live a monastic lifestyle. No, I do. I do live in extremes, basically. I go back and forth. Once every six months, I’ll have a day where I eat more chocolate than has ever been consumed by a human being.” – Jim Carrey",
    "“I absolutely want to have a career where you make’em laugh and make’em cry. It’s all theater.” – Jim Carrey",
    "“I really believe in the philosophy that you create your own universe. I’m just trying to create a good one for myself.” – Jim Carrey",
    "“Ever since I started to get recognition I’ve picked out certain fans and reverse-stalked them.” – Jim Carrey",
    "“But, you know, you can’t be a star at home.” – Jim Carrey",
    "“I really want to love somebody. I do. I just don’t know if it’s possible forever and ever.” – Jim Carrey",
    "“I’ve arrived at the place if I’m not taking a career risk, I’m not happy. If I’m scared, then I know I’m being challenged.” – Jim Carrey",
    "“We had problems like all families but we had a lot of love. I was extremely loved. We always felt we had each other.” – Jim Carrey",
    "“I don’t make it in regular channels, and that’s okay for me.” – Jim Carrey",
    "“So many of us choose our path out of fear disguised as practicality. What we really want seems impossibly out of reach so we never dare to ask the universe for it. I’m the proof that you can ask the universe for it”– Jim Carrey",
    "“I learned many great lessons from my father, not the least of which, was that you can fail at what you don’t want so you might as well take a chance on doing what you love”– Jim Carrey",
    "“I’m making a conscious choice to see challenges as beneficial so that I can deal with them in the most productive way”– Jim Carrey",
    "“I’m very serious about no alcohol, no drugs. Life is too beautiful.” – Jim Carrey",
    "“I don’t believe in hope. Hope is a beggar. Hope walks through the fire, faith leaps over it.”– Jim Carrey",
    "“If you’ve got a talent, protect it.” – Jim Carrey",
    "“You know the trouble with real life? There’s no danger music.” – Jim Carrey",
    "“Your need for acceptance can make you invisible in this world.” – Jim Carrey",
    "“Life doesn’t happen to you. It happens for you.” – Jim Carrey",
    "“I think everybody should get rich and famous and do everything they ever dreamed of so they can see that it’s not the answer.” ― Jim Carrey",
    "“The effect you have on others is the most valuable currency there is.” ― Jim Carrey",
    "“Isn’t it cool when the days that are supposed to feel good, actually do?”― Jim Carrey",
    "“When things are really bad the only thing to do is laugh” ― Jim Carrey",
    "“For the most sensitive among us, the noise can be too much.” – Jim Carrey",
    "“People need the motivation to do anything. I don’t think human beings learn anything without desperation.”– Jim Carrey",
    "“No doubt, there are reasons for your worries, no one could dispute, but that doesn’t make them any less useless. It’s ok to let them go.”— Jim Carrey",
    "“My soul is not contained within the limits of my body. And My body is contained within the limitlessness of my soul.” – Jim Carrey",
    "“All that you see and all that you don’t see, is you. Feel that and be free. There are no two things.”— Jim Carrey",
    "“There is a huge difference between a dog that is going to eat you in your mind and an actual dog that’s going to eat you.” – Jim Carrey",
    "“I used to spend a lot of time burning with anxiety. That happens when you imagine that you’re less than infinite.”— Jim Carrey",
    "“Never let your mind and your ego fill you with the fear of failure and turn you against your playful heart.”— Jim Carrey",
    "“Don’t worry folks as long as the Sun is revolving around the Earth, we’ll be fine!”— Jim Carrey",
    "“I wish you all freedom from past regrets, fear of the future and the illusion of time itself. Don’t wait for a countdown.”— Jim Carrey",
    "“I don’t decide when the sun will shine but I know that it will never shine without me.”— Jim Carrey",
    "“I feel that we’re all lighthouses, and my job is to shine my light as brightly as I can to the darkness.” – Jim Carrey",
    "“I used to be a guy who was experiencing the Universe, but now I feel like the Universe experiencing a guy.” – Jim Carrey"
  ]
}
